import { IRegion } from '../../src/@protocols/region.protocol'
import { ObjectId } from '../../src/modules/base/entities/base.entity'

export const regionsMock: IRegion[] = [
  {
    _id: new ObjectId(),
    polygon: {
      coordinates: [
        [
          [-44.81753603382805, -19.207034899686036],
          [-44.81753603382805, -21.774035882301007],
          [-41.822589480169654, -21.774035882301007],
          [-41.822589480169654, -19.207034899686036],
          [-44.81753603382805, -19.207034899686036]
        ]
      ],
      type: 'Polygon'
    },
    isDeleted: false,
    name: 'Região 1',
    user: null
  },
  {
    _id: new ObjectId(),
    polygon: {
      coordinates: [
        [
          [-47.78062804643443, -19.356712271093016],
          [-47.78062804643443, -19.498810710196295],
          [-47.6187701887159, -19.498810710196295],
          [-47.6187701887159, -19.356712271093016],
          [-47.78062804643443, -19.356712271093016]
        ]
      ],
      type: 'Polygon'
    },
    isDeleted: false,
    name: 'Região 2',
    user: null
  },
  {
    _id: new ObjectId(),
    polygon: {
      coordinates: [
        [
          [-47.389924084814965, -19.372588653409153],
          [-47.389924084814965, -19.54619458452879],
          [-47.23927198282976, -19.54619458452879],
          [-47.23927198282976, -19.372588653409153],
          [-47.389924084814965, -19.372588653409153]
        ]
      ],
      type: 'Polygon'
    },
    isDeleted: false,
    name: 'Região 3',
    user: null
  },
  {
    _id: new ObjectId(),
    polygon: {
      coordinates: [
        [
          [-47.10535752706335, -19.388262249669708],
          [-47.10535752706335, -19.5527062757958],
          [-46.90860187479245, -19.5527062757958],
          [-46.90860187479245, -19.388262249669708],
          [-47.10535752706335, -19.388262249669708]
        ]
      ],
      type: 'Polygon'
    },
    isDeleted: false,
    name: 'Região 4',
    user: null
  }
]
